IdeaRS.OpenModel.Concrete.CheckResult.CheckResult
The number in enum value description means the priority for extreme check evaluation.

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.Failed
3. check value is bigger than limit check value

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.Passed
5. check value is lesser than limit check value

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.PassedWithWarnings
4. check value is lesser than limit check value, but there is a warning in calculation

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.FailedWithError
2. error appeared during calculation, calculation was terminated

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.CheckIsOff
7. this kind of the calculation was switched off

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.NotDone
1. this kind of the calculation was not done

IdeaRS.OpenModel.Concrete.CheckResult.CheckResult.CheckIsNotNecesssary
6. check for some reason not necessary